---
kind: other
id: Properties.T:Autodesk.Revit.DB.FilterStringEquals
source: html/df61da59-9937-5254-fb3a-1978d115a533.htm
---
# FilterStringEquals Properties

Specifies whether the .NET object represents a valid Revit entity.